//IUCSDUP JOB (FB3),'DFHCSDUP',CLASS=A,MSGCLASS=H,                              
//       NOTIFY=&SYSUID,REGION=0M,TIME=1440                                     
//*      TYPRUN=HOLD                                                            
//********************************************************************          
//*                                                                  *          
//* PURPOSE: MortgageApplication CICS CSD                            *          
//*                                                                  *          
//********************************************************************          
//STEP1   EXEC PGM=DFHCSDUP,REGION=0M,                                          
//             PARM='CSD(READWRITE),PAGESIZE(60),NOCOMPAT'                      
//STEPLIB DD   DSN=DFH610.CICS.SDFHLOAD,DISP=SHR                                
//DFHCSD   DD  DISP=SHR,DSN=DFH610.CICS.DFHCSD                                  
//OUTDD    DD  SYSOUT=A                                                         
//SYSPRINT DD  SYSOUT=A                                                         
//SYSIN    DD  *                                                                
  ADD GROUP(ZOFFICE) LIST(APPLIST)                                              
  DEFINE MAPSET(EPSMORT) GROUP(ZOFFICE)                                         
         RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)              
  DEFINE PROGRAM(EPSCMORT) GROUP(ZOFFICE)                                       
         LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                  
         USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)             
         EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)          
         EXECUTIONSET(FULLAPI) JVM(NO)                                          
  DEFINE PROGRAM(EPSCSMRT) GROUP(ZOFFICE)                                       
         LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                  
         USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)             
         EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)          
         EXECUTIONSET(FULLAPI) JVM(NO)                                          
  DEFINE PROGRAM(EPSMPMT) GROUP(ZOFFICE)                                        
         LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                  
         USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)             
         EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)          
         EXECUTIONSET(FULLAPI) JVM(NO)                                          
  DEFINE TRANSACTION(EPSP) GROUP(ZOFFICE)                                       
         PROGRAM(EPSCMORT) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)         
         TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                    
         RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)            
         ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)               
         RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)               
         CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                  
         WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                  
/*                                                                              
