//IURACFX JOB  (FB3),'RACF ZCX',CLASS=A,MSGCLASS=H,                             
//       NOTIFY=&SYSUID,MSGLEVEL=(1,1)                                          
//*                                                                             
//********************************************************************          
//*                                                                  *          
//* PURPOSE: Define JCLX rules in RACF                               *          
//*                                                                  *          
//********************************************************************          
//RACFSTC  EXEC PGM=IKJEFT1A,DYNAMNBR=75,TIME=100,REGION=6M                     
//SYSTERM  DD DUMMY                                                             
//STDOUT   DD SYSOUT=*                                                          
//STDERR   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//STDIN    DD *                                                                 
//STDENV   DD *                                                                 
//SYSTSIN  DD *                                                                 
PROFILE NOPREFIX                                                                
                                                                                
ADDUSER CXPSRV DFLTGRP(SYS1) NOPASSWORD OMVS(PROGRAM(/bin/sh) +                 
  HOME(/global/jclexpert))                                                      
CONNECT CXPSRV GROUP(CXPUSER) OWNER(CXPSRV)                                     
RDEFINE STARTED CXPSRV.** STDATA(USER(CXPSRV) GROUP(SYS1) TRUSTED(YES))         
SETROPTS RACLIST(STARTED) REFRESH                                               
                                                                                
SETROPTS WHEN(PROGRAM)                                                          
RDEFINE PROGRAM CXPSRV ADDMEM('JCL120.CXP.SCXPLOAD'//NOPADCHK) UACC(READ)       
SETROPTS WHEN(PROGRAM) REFRESH                                                  
                                                                                
RDEFINE FACILITY BPX.SERVER UACC(NONE)                                          
                                                                                
PERMIT BPX.SERVER CLASS(FACILITY) ID(CXPSRV) ACCESS(READ)                       
SETROPTS RACLIST(FACILITY) REFRESH                                              
                                                                                
PERMIT BPX.SRV.** CLASS(SURROGAT) ACC(READ) ID(CXPSRV)                          
SETROPTS RACLIST(SURROGAT) REFRESH                                              
                                                                                
RDEFINE FACILITY CXP.JCLCKUSR.** UACC(NONE) OWNER(CXPADM)                       
                                                                                
ADDUSER CXPCLNT DFLTGRP(CXPUSER) +                                              
  OMVS(AUTOUID PROGRAM(/bin/sh) HOME(/u/automount/cxpclnt))                     
                                                                                
PERMIT CXP.JCLCKUSR.** CLASS(FACILITY) ACC(READ) ID(CXPCLNT)                    
SETROPTS REFRESH RACLIST(FACILITY)                                              
                                                                                
RACDCERT CERTAUTH GENCERT +                                                     
  SUBJECTSDN(CN('JCL Expert z31a Root CA') +                                    
  OU('DTSC') +                                                                  
  O('IBM')) +                                                                   
  WITHLABEL('CXPRootCert') +                                                    
  TRUST NOTAFTER(DATE(2050/01/02))                                              
                                                                                
RACDCERT ID(CXPSRV) GENCERT +                                                   
  SUBJECTSDN(CN('S0W1.DAL-EBIS.IHOST.COM') +                                    
  OU('DTSC') +                                                                  
  O('IBM')) +                                                                   
  WITHLABEL('CXPServerCert') +                                                  
  SIGNWITH(CERTAUTH LABEL('CXPRootCert')) +                                     
  NOTAFTER(DATE(2050/01/02))                                                    
                                                                                
RACDCERT ALTER(LABEL('CXPServerCert')) ID(CXPSRV) TRUST                         
                                                                                
RACDCERT ADDRING(CXPServerRing) ID(CXPSRV)                                      
                                                                                
RACDCERT ID(CXPSRV) CONNECT (LABEL('CXPRootCert') +                             
  RING(CXPServerRing) CERTAUTH)                                                 
                                                                                
RACDCERT ID(CXPSRV) CONNECT (LABEL('CXPServerCert') +                           
  RING(CXPServerRing) DEFAULT)                                                  
                                                                                
SETROPTS RACLIST(DIGTCERT, DIGTRING) REFRESH                                    
                                                                                
RDEFINE FACILITY IRR.DIGTCERT.LIST UACC(NONE)                                   
RDEFINE FACILITY IRR.DIGTCERT.LISTRING UACC(NONE)                               
                                                                                
PERMIT IRR.DIGTCERT.LIST CLASS(FACILITY) ID(CXPSRV) ACCESS(READ)                
PERMIT IRR.DIGTCERT.LISTRING CLASS(FACILITY) ID(CXPSRV) ACCESS(READ)            
SETROPTS RACLIST(FACILITY) REFRESH                                              
