//IUDSSRE JOB (FB3),'DSSREST',CLASS=A,MSGCLASS=H,                               
//        NOTIFY=&SYSUID,REGION=0M,TIME=1440                                    
//*       TYPRUN=HOLD                                                           
//*-----------------------------------------------------------------*           
//* JOB:   IUDSSRE                                                              
//* DESC:  DSS BACKUP RESTORE                                                   
//* STEPS: <NONE>                                                               
//* AUTH:  Ben               DATE: 2026-04-06                                   
//* NOTE:  REMOVE PARM TYPRUN=NORUN TO PERFORM ACTUAL RESTORE                   
//*-----------------------------------------------------------------*           
                                                                                
//STEP1    EXEC PGM=ADRDSSU,PARM='TYPRUN=NORUN'                                 
//TAPE     DD DSN=STG.WEEKLY.PRM006.BACKUP.G0745V00,DISP=SHR                    
//OUT1     DD VOL=SER=PRM002,UNIT=SYSDA,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  RESTORE INDD(TAPE) -                                                          
          OUTDD(OUT1) -                                                         
  DS(INCL(HARBORRQ.DCSWEBZ1.**))  -                                             
  RENAMEU(HARBORRQ.DCSWEBZ1.**,   -                                             
          XBT.DCSWEBZ1.**)        -                                             
  CATALOG                                                                       
/*                                                                              
// LIST CONTENTS OF DUMP FILE                                                   
  RESTORE INDDNAME(TAPE) -                                                      
  DATASET(INCLUDE(**))                                                          
//                                                                              
//                                                                              
  RESTORE INDD(TAPE) -                                                          
          OUTDD(OUT1) -                                                         
          MAKEMULTI -                                                           
  OUTDYNAM((LAR001),(LAR002),(LAR003),(LAR004)) -                               
  DS(INCL(CMPWAREP.LMS.CHKPT)) CATALOG REPLACE -                                
//                                                                              
//*-----------------------------------------------------------------*           
//* End of Job                                                                  
//*-----------------------------------------------------------------*           
