//IULIKEC JOB (FB3),'LIKECOPY',CLASS=A,MSGCLASS=H,                              
//        NOTIFY=&SYSUID,REGION=0M,TIME=1440                                    
//*       TYPRUN=HOLD                                                           
//*-----------------------------------------------------------------*           
//* JOB:   IULIKEC                                                              
//* DESC:  CREATE DATASET USING ATTRIBUTES OF BASE                              
//* STEPS: <NONE>                                                               
//* AUTH:  Ben               DATE: 2025-08-04                                   
//* NOTE:  ENSURE SOURCE DATASET EXISTS AND IS CATALOGED                        
//*-----------------------------------------------------------------*
//LIKECPY EXEC PGM=IEFBR14                                                      
//SMSDS1  DD DSNAME=IBMUSER.COBOL.LOAD.NEW,                                     
//        LIKE=IBMUSER.COBOL.LOAD,DISP=(NEW,KEEP)                               
//*-----------------------------------------------------------------*           
//* End of Job                                                                  
//*-----------------------------------------------------------------*           
