//IUSMFDM JOB (FB3),'SMF DUMP',CLASS=A,MSGCLASS=H,                              
//       NOTIFY=&SYSUID,REGION=0M,TIME=1440                                     
//*      TYPRUN=HOLD                                                            
//*-----------------------------------------------------------------*           
//* JOB:   IUSMFDMP                                                             
//* DESC:  SMF DUMP TYPE 119 FOR ZERT                                           
//* STEPS: 1-DELETE, 2-DUMP                                                     
//* AUTH:  Ben               DATE: 2026-04-06                                   
//* NOTE:  <Key prerequisite or caution (optional)>                             
//*-----------------------------------------------------------------*           
//*-- 1: DELETE EXISTING SMF TYPE 119 OUTPUT DATASET ------------------*
//DELETE   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DELETE 'SMF.ZERT.TYPE119'                                                     
  SET MAXCC=0                                                                   
/*
//*
//*-- 2: DUMP SMF TYPE 119 RECORDS TO SEQUENTIAL DATASET --------------*
//DUMP     EXEC PGM=IFASMFDP,REGION=4096K                                       
//SYSPRINT DD SYSOUT=*                                                          
//OUTD1    DD DSN=SMF.ZERT.TYPE119,                                             
//          SPACE=(CYL,(1,1)),DISP=(NEW,CATLG)                                  
//INDD1    DD DSN=SMF.S0W1.DATA(0),DISP=SHR                                     
//SYSIN    DD *                                                                 
  INDD(INDD1,OPTIONS(DUMP))                                                     
  OUTDD(OUTD1,TYPE(119(12)))                                                    
/*                                                                              
//*-----------------------------------------------------------------*           
//* End of Job                                                                  
//*-----------------------------------------------------------------*           
