//IUXMIT JOB (FB3),'XMIT',CLASS=A,MSGCLASS=H,                                   
//       NOTIFY=&SYSUID,REGION=0M,TIME=1440                                     
//*      TYPRUN=HOLD                                                            
//*-----------------------------------------------------------------*           
//* JOB:   IUXMIT                                                               
//* DESC:  <One-line purpose>                                                   
//* STEPS: <Very brief step summary, if needed>                                 
//* AUTH:  Ben               DATE: 2026-04-17                                   
//* NOTE:  <Key prerequisite or caution (optional)>                             
//*-----------------------------------------------------------------*           
//*-- 1: UNPACK TERSED LOAD LIBRARY USING AMATERSE --------------------*
//AMATERSE EXEC PGM=AMATERSE,PARM=UNPACK                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=IBMUSER.COBOL.LOAD.XMIT.TRS                          
//SYSUT2   DD DSN=IBMUSER.COBOL.LOAD.XMIT,                                      
//            DISP=(NEW,CATLG),UNIT=SYSDA,                                      
//            SPACE=(TRK,(1,1),RLSE)                                            
//*
//*-- 2: RECEIVE XMIT FILE TO RESTORE LOAD LIBRARY --------------------*
//RECVPDS  EXEC PGM=IKJEFT01,COND=(0,NE)                                        
//INPUT    DD DISP=SHR,DSN=IBMUSER.COBOL.LOAD.XMIT                              
//SYSTSIN  DD *                                                                 
  RECEIVE INFILE(INPUT) NONAMES                                                 
     DSNAME('IBMUSER.COBOL.LOAD') RELEASE                                       
/*                                                                              
//SYSTSPRT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* End of Job                                                                  
//*-----------------------------------------------------------------*           
                                                                                
